In [77]:
import pandas as pd
from sklearn.cluster import KMeans
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [78]:
df = pd.read_csv('dataset.csv')
df.head()

,ASL,Nama,Matematika,Fisika,Kimia,Biologi,Sejarah,Akuntansi,Sosiologi,Geografi
0,2012173,Afgansyah,79,75,75,85,76,78,76,80
1,2012174,Denny Sumargo,84,76,79,77,76,77,75,81
2,2012175,Lina Nur Aini,77,84,78,85,92,89,77,82
3,2012176,Ananda Anugrah,78,86,84,77,78,77,75,75
4,2012177,Putri Khadijah,82,82,81,91,90,82,79,91

In [79]:
df.drop(['Nama', 'ASL'], axis=1, inplace=True)

In [80]:
df.head()

   Matematika  Fisika  Kimia  Biologi  Sejarah  Akuntansi  Sosiologi  Geografi
0          79      75     75       85       76         78         76        80
1          84      76     79       77       76         77         75        81
2          77      84     78       85       92         89         77        82
3          78      86     84       77       78         77         75        75
4          82      82     81       91       90         82         79        91

In [81]:
# mengelompokkan data dengan metode k-means
model = KMeans(n_clusters=3)
model.fit(df)

KMeans(n_clusters=3)

In [82]:
# melihat label cluster yang sudah terbentuk
labels = model.labels_
labels

array([0, 2, 1, 2, 1, 0, 0, 2, 0, 2, 2, 2])

In [83]:
from sklearn.metrics import silhouette_samples, silhouette_score
score = silhouette_score(df, model.labels_, metric='euclidean')
print('Silhouetter Score: %.3f' % score)
print("Inertia  :", model.inertia_)

Silhouetter Score: 0.251
Inertia  : 584.0833333333333

In [84]:
data_test = pd.read_csv('data_test.csv')
data_test.head()

   Matematika  Fisika  Kimia  Biologi  Sejarah  Akuntansi  Sosiologi  Geografi
0          50      60     77       80       90         95         45        88
1          90      85     87       90       88         55         68        77
2          75      77     56       73       84         63         79        55

In [85]:
# predict the cluster for each data point
predictions = model.predict(data_test)
predictions

array([0, 0, 0])